# InvalidRebarHostNonStructural Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..InvalidRebarHostNonStructural Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar can't be placed in a non-structural element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidRebarHostNonStructural { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidRebarHostNonStructural As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidRebarHostNonStructural {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace